Replaced all ASCII diagrams with mermaid
